junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi_portal.c
/* SPDX-License-Identifier: Apache-2.0 */
#include "bk7259_wifi_internal.h"
#include "bk7259_ops.h"

#include <common/bk_err.h>
#include "bk7259_platform_log.h"
#include <components/netif.h>
#include <lwip/inet.h>
#include <lwip/sockets.h>
#include <modules/wifi.h>
#include <os/mem.h>
#include <os/os.h>

#include "cJSON.h"

#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>

#define TAG "mybot_portal"
#define PORTAL_HTTP_PORT 80
#define PORTAL_AP_CHANNEL 1
#define PORTAL_HTTP_HEADER_MAX 1024U
#define PORTAL_HTTP_BODY_MAX 512U
#define PORTAL_HTTP_REQUEST_TIMEOUT_MS 7000U
#define PORTAL_HTTP_IO_TIMEOUT_MS 1000U
#define PORTAL_HTTP_POLL_MS 200U
#define PORTAL_CONNECT_TIMEOUT_MS 20000U
#define PORTAL_SCAN_TIMEOUT_MS 15000U
#define PORTAL_EXIT_DELAY_MS 200U
#define PORTAL_MAX_SCAN_RESULTS 24U
#define PORTAL_SCAN_JSON_MAX 6144U

typedef struct {
    char method[8];
    char target[64];
    char body[PORTAL_HTTP_BODY_MAX + 1U];
    size_t body_length;
    bool has_content_length;
    bool content_type_json;
} portal_http_request_t;

typedef struct {
    bool ap_started;
    char ap_ssid[WIFI_SSID_STR_LEN];
} portal_context_t;

static const char s_portal_html[] =
    "<!doctype html><html><head><meta charset='utf-8'><meta name='viewport' "
    "content='width=device-width,initial-scale=1'><title>Wi-Fi setup</title><style>"
    "*{box-sizing:border-box}body{font:15px system-ui;margin:0;background:#f3f5f7;color:#17202a}"
    "main{max-width:440px;margin:auto;padding:24px 16px}section{background:#fff;border:1px solid "
    "#dfe4e8;border-radius:8px;padding:18px}h1{font-size:22px;margin:0 0 16px}label{display:block;"
    "margin:10px 0 5px}select,input,button{width:100%;min-height:42px;padding:9px;border:1px solid "
    "#aeb8c2;border-radius:6px;background:#fff}button{margin-top:12px;background:#1769aa;color:#fff;"
    "border:0;font-weight:600}button:disabled{background:#8c9aa6}#status{min-height:20px;color:#5b6670}"
    ".error{color:#b3261e}</style></head><body><main><section><h1>Wi-Fi setup</h1><form id='f'>"
    "<label for='nets'>Network</label><select id='nets'><option value=''>Scanning...</option></select>"
    "<label for='ssid'>SSID</label><input id='ssid' maxlength='32' required><label for='password'>"
    "Password</label><input id='password' type='password' maxlength='64'><button id='submit'>"
    "Connect</button></form><p id='status'></p></section></main><script>const q=s=>document.querySelector(s);"
    "async function scan(){try{const d=await fetch('/scan',{cache:'no-store'}).then(r=>{if(!r.ok)"
    "throw Error();return r.json()}),n=q('#nets');n.innerHTML='<option value=\"\">Manual entry</option>';"
    "d.aps.forEach(a=>{const o=document.createElement('option');o.value=a.ssid;o.textContent="
    "a.ssid+' ('+a.rssi+' dBm)';n.appendChild(o)})}catch(e){q('#nets').innerHTML="
    "'<option value=\"\">Manual entry</option>'}}q('#nets').onchange=e=>{if(e.target.value)"
    "q('#ssid').value=e.target.value};q('#f').onsubmit=async e=>{e.preventDefault();const b=q('#submit'),"
    "s=q('#status');b.disabled=true;s.className='';s.textContent='Connecting...';try{const r=await "
    "fetch('/submit',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({"
    "ssid:q('#ssid').value,password:q('#password').value})}),d=await r.json();if(!r.ok||!d.success)"
    "throw Error(d.error||'Connection failed');s.textContent='Connected'}catch(x){s.className='error';"
    "s.textContent=x.message;b.disabled=false}};scan()</script></body></html>";

static void secure_zero(void *memory, size_t length) {
    volatile unsigned char *cursor = memory;
    while (length-- > 0) {
        *cursor++ = 0;
    }
}

static size_t bounded_strlen(const char *value, size_t capacity) {
    size_t length = 0;
    while (length < capacity && value[length] != '\0') {
        ++length;
    }
    return length;
}

static bool contains_json_nul_escape(const char *value, size_t length) {
    for (size_t i = 0; i + 5U < length; ++i) {
        if (value[i] != '\\' || value[i + 1U] != 'u' || value[i + 2U] != '0' ||
            value[i + 3U] != '0' || value[i + 4U] != '0' || value[i + 5U] != '0') {
            continue;
        }

        size_t slash_count = 1;
        for (size_t j = i; j > 0 && value[j - 1U] == '\\'; --j) {
            ++slash_count;
        }
        if ((slash_count & 1U) != 0) {
            return true;
        }
    }
    return false;
}

static bool timeout_elapsed(uint32_t start, uint32_t timeout_ms) {
    return (uint32_t)(rtos_get_time() - start) >= timeout_ms;
}

static void build_ap_ssid(char output[WIFI_SSID_STR_LEN], const char *device_id) {
    uint8_t mac[WIFI_MAC_LEN] = {0};
    if (bk_wifi_ap_get_mac(mac) == BK_OK) {
        (void)snprintf(output, WIFI_SSID_STR_LEN, "mybot-%02x%02x", mac[4], mac[5]);
        return;
    }

    uint32_t hash = 2166136261U;
    for (size_t i = 0; device_id[i] != '\0'; ++i) {
        hash = (hash ^ (uint8_t)device_id[i]) * 16777619U;
    }
    (void)snprintf(output, WIFI_SSID_STR_LEN, "mybot-%04x", (unsigned)(hash & 0xffffU));
}

static int start_softap(portal_context_t *ctx) {
    netif_ip4_config_t ip4 = {0};
    (void)snprintf(ip4.ip, sizeof(ip4.ip), "%s", "192.168.4.1");
    (void)snprintf(ip4.mask, sizeof(ip4.mask), "%s", "255.255.255.0");
    (void)snprintf(ip4.gateway, sizeof(ip4.gateway), "%s", "192.168.4.1");
    (void)snprintf(ip4.dns, sizeof(ip4.dns), "%s", "192.168.4.1");
    if (bk_netif_set_ip4_config(NETIF_IF_AP, &ip4) != BK_OK) {
        MYBOT_LOGE(TAG, "failed to configure SoftAP IPv4");
        return -1;
    }

    wifi_ap_config_t config = {0};
    (void)snprintf(config.ssid, sizeof(config.ssid), "%s", ctx->ap_ssid);
    config.channel = PORTAL_AP_CHANNEL;
    config.security = WIFI_SECURITY_NONE;
    config.max_con = 2;
    config.disable_dns_server = 0;
    if (bk_wifi_ap_set_config(&config) != BK_OK || bk_wifi_ap_start() != BK_OK) {
        MYBOT_LOGE(TAG, "failed to configure or start SoftAP");
        (void)bk_wifi_ap_stop();
        return -1;
    }

