junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi_portal.c
    ctx->ap_started = true;
    bk7259_lcd_set_provisioning_ssid(ctx->ap_ssid);
    MYBOT_LOGI(TAG, "SoftAP started");
    return 0;
}

static int stop_softap(portal_context_t *ctx) {
    if (!ctx->ap_started) {
        return 0;
    }
    if (bk_wifi_ap_stop() != BK_OK) {
        MYBOT_LOGE(TAG, "failed to stop SoftAP");
        return -1;
    }
    ctx->ap_started = false;
    bk7259_lcd_set_provisioning_ssid("");
    MYBOT_LOGI(TAG, "SoftAP stopped");
    return 0;
}

static int wait_socket(int fd, bool writable, uint32_t timeout_ms) {
    fd_set read_fds;
    fd_set write_fds;
    struct timeval timeout = {
        .tv_sec = (long)(timeout_ms / 1000U),
        .tv_usec = (long)((timeout_ms % 1000U) * 1000U),
    };

    FD_ZERO(&read_fds);
    FD_ZERO(&write_fds);
    if (writable) {
        FD_SET(fd, &write_fds);
    } else {
        FD_SET(fd, &read_fds);
    }
    return select(fd + 1, writable ? NULL : &read_fds, writable ? &write_fds : NULL,
                  NULL, &timeout);
}

static int send_all(int fd, const void *data, size_t length) {
    const uint8_t *cursor = data;
    uint32_t started = rtos_get_time();

    while (length > 0 && !timeout_elapsed(started, PORTAL_HTTP_IO_TIMEOUT_MS)) {
        int ready = wait_socket(fd, true, PORTAL_HTTP_POLL_MS);
        if (ready < 0) {
            if (errno == EINTR) {
                continue;
            }
            return -1;
        }
        if (ready == 0) {
            continue;
        }

        int sent = send(fd, cursor, length, 0);
        if (sent < 0 && (errno == EINTR || errno == EAGAIN || errno == EWOULDBLOCK)) {
            continue;
        }
        if (sent <= 0) {
            return -1;
        }
        cursor += (size_t)sent;
        length -= (size_t)sent;
    }
    return length == 0 ? 0 : -1;
}

static int send_http_response(int fd, const char *status, const char *content_type,
                              const char *extra_headers, const char *body,
                              size_t body_length) {
    char header[256];
    int header_length = snprintf(header, sizeof(header),
                                 "HTTP/1.1 %s\r\nContent-Type: %s\r\nContent-Length: %u\r\n"
                                 "Cache-Control: no-store\r\nConnection: close\r\n%s\r\n",
                                 status, content_type, (unsigned)body_length,
                                 extra_headers ? extra_headers : "");
    if (header_length < 0 || (size_t)header_length >= sizeof(header) ||
        send_all(fd, header, (size_t)header_length) < 0) {
        return -1;
    }
    return body_length == 0 || send_all(fd, body, body_length) == 0 ? 0 : -1;
}

static char *trim_header_value(char *value) {
    while (*value == ' ' || *value == '\t') {
        ++value;
    }
    size_t length = strlen(value);
    while (length > 0 && (value[length - 1] == ' ' || value[length - 1] == '\t')) {
        value[--length] = '\0';
    }
    return value;
}

static int parse_content_length(const char *value, size_t *output) {
    if (!value || *value < '0' || *value > '9') {
        return -1;
    }
    errno = 0;
    char *end = NULL;
    unsigned long parsed = strtoul(value, &end, 10);
    if (errno != 0 || !end || *end != '\0' || parsed > PORTAL_HTTP_BODY_MAX) {
        return -1;
    }
    *output = (size_t)parsed;
    return 0;
}

static int parse_http_header(char *buffer, char *header_end,
                             portal_http_request_t *request, size_t *content_length) {
    char *request_line_end = strstr(buffer, "\r\n");
    char version[16] = {0};
    char extra = '\0';
    if (!request_line_end || request_line_end >= header_end) {
        return -1;
    }
    *request_line_end = '\0';
    if (sscanf(buffer, "%7s %63s %15s %c", request->method, request->target,
               version, &extra) != 3 || strncmp(version, "HTTP/1.", 7) != 0 ||
        (version[7] != '0' && version[7] != '1') || version[8] != '\0') {
        return -1;
    }

    bool have_content_type = false;
    char *line = request_line_end + 2;
    while (line < header_end) {
        char *line_end = strstr(line, "\r\n");
        if (!line_end || line_end > header_end || line_end == line) {
            return -1;
        }
        *line_end = '\0';
        char *colon = strchr(line, ':');
        if (!colon || colon == line) {
            return -1;
        }
        *colon = '\0';
        char *value = trim_header_value(colon + 1);

        if (strcasecmp(line, "Content-Length") == 0) {
            if (request->has_content_length || parse_content_length(value, content_length) < 0) {
                return -1;
            }
            request->has_content_length = true;
        } else if (strcasecmp(line, "Content-Type") == 0) {
            if (have_content_type) {
                return -1;
            }
            have_content_type = true;
            request->content_type_json = strcasecmp(value, "application/json") == 0;
        } else if (strcasecmp(line, "Transfer-Encoding") == 0 ||
                   strcasecmp(line, "Expect") == 0) {
            return -1;
        }
        line = line_end + 2;
    }
    return 0;
}

static int receive_http_request(int fd, portal_http_request_t *request) {
    const size_t capacity = PORTAL_HTTP_HEADER_MAX + PORTAL_HTTP_BODY_MAX;
    char *buffer = os_malloc(capacity + 1U);
    if (!buffer) {
        return -1;
    }

    int result = -1;
    size_t received = 0;
    size_t required = 0;
    size_t header_length = 0;
    uint32_t started = rtos_get_time();
    while (received < capacity &&
           !timeout_elapsed(started, PORTAL_HTTP_REQUEST_TIMEOUT_MS)) {
        int ready = wait_socket(fd, false, PORTAL_HTTP_POLL_MS);
        if (ready < 0) {
            if (errno == EINTR) {
                continue;
            }
            break;
        }
        if (ready == 0) {
            continue;
        }

        int count = recv(fd, buffer + received, capacity - received, 0);
        if (count < 0 && (errno == EINTR || errno == EAGAIN || errno == EWOULDBLOCK)) {
            continue;
        }
        if (count <= 0) {
            break;
        }
        received += (size_t)count;
        buffer[received] = '\0';

        if (header_length == 0) {
            char *header_end = strstr(buffer, "\r\n\r\n");
            if (!header_end) {
                if (received >= PORTAL_HTTP_HEADER_MAX) {
                    break;
                }
                continue;
            }
            header_length = (size_t)(header_end - buffer) + 4U;
            size_t content_length = 0;
            if (header_length > PORTAL_HTTP_HEADER_MAX ||
                parse_http_header(buffer, header_end, request, &content_length) < 0) {
                break;
            }
            required = header_length + content_length;
        }

        if (header_length != 0 && received >= required) {
            if (received != required) {
                break;
            }
            request->body_length = required - header_length;
            if (request->body_length > 0) {
                memcpy(request->body, buffer + header_length, request->body_length);
            }
            request->body[request->body_length] = '\0';
            result = 0;
            break;
        }
    }

