junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi_portal.c
    secure_zero(buffer, received);
    os_free(buffer);
    return result;
}

static int security_to_authmode(wifi_security_t security) {
    switch (security) {
    case WIFI_SECURITY_NONE:
        return 0;
    case WIFI_SECURITY_WEP:
        return 1;
    case WIFI_SECURITY_WPA_TKIP:
    case WIFI_SECURITY_WPA_AES:
    case WIFI_SECURITY_WPA_MIXED:
        return 2;
    case WIFI_SECURITY_WPA2_TKIP:
    case WIFI_SECURITY_WPA2_AES:
    case WIFI_SECURITY_WPA2_MIXED:
        return 3;
    case WIFI_SECURITY_EAP:
        return 5;
    case WIFI_SECURITY_WPA3_SAE:
        return 6;
    case WIFI_SECURITY_WPA3_WPA2_MIXED:
        return 7;
    case WIFI_SECURITY_OWE:
        return 9;
    default:
        return 3;
    }
}

static char *build_scan_json(const wifi_scan_ap_info_t *results, size_t result_count) {
    cJSON *root = cJSON_CreateObject();
    cJSON *aps = NULL;
    if (!root || !cJSON_AddBoolToObject(root, "support_5g", false) ||
        !(aps = cJSON_AddArrayToObject(root, "aps"))) {
        cJSON_Delete(root);
        return NULL;
    }

    for (size_t i = 0; i < result_count; ++i) {
        size_t ssid_length = bounded_strlen(results[i].ssid, sizeof(results[i].ssid));
        if (ssid_length == 0 || ssid_length >= sizeof(results[i].ssid)) {
            continue;
        }
        cJSON *ap = cJSON_CreateObject();
        if (!ap || !cJSON_AddStringToObject(ap, "ssid", results[i].ssid) ||
            !cJSON_AddNumberToObject(ap, "rssi", results[i].rssi) ||
            !cJSON_AddNumberToObject(ap, "authmode",
                                     security_to_authmode(results[i].security)) ||
            !cJSON_AddItemToArray(aps, ap)) {
            cJSON_Delete(ap);
            cJSON_Delete(root);
            return NULL;
        }
    }

    char *json = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    if (json && strlen(json) > PORTAL_SCAN_JSON_MAX) {
        cJSON_free(json);
        return NULL;
    }
    return json;
}

static int handle_scan(int fd) {
    MYBOT_LOGI(TAG, "Wi-Fi scan requested");
    wifi_scan_ap_info_t *results =
        os_zalloc(PORTAL_MAX_SCAN_RESULTS * sizeof(*results));
    if (!results) {
        MYBOT_LOGE(TAG, "Wi-Fi scan result allocation failed");
        return send_http_response(fd, "500 Internal Server Error", "application/json",
                                  NULL, "{\"aps\":[]}", sizeof("{\"aps\":[]}") - 1U);
    }

    size_t result_count = 0;
    int scan_result = bk7259_wifi_manager_scan_sync(
        results, PORTAL_MAX_SCAN_RESULTS, &result_count, PORTAL_SCAN_TIMEOUT_MS);
    if (result_count > PORTAL_MAX_SCAN_RESULTS) {
        scan_result = -1;
    }
    char *json = scan_result == 0 ? build_scan_json(results, result_count) : NULL;
    os_free(results);
    if (!json) {
        MYBOT_LOGW(TAG, "Wi-Fi scan failed: result=%d count=%u", scan_result,
                (unsigned)result_count);
        return send_http_response(fd, scan_result == 0 ? "500 Internal Server Error"
                                                       : "503 Service Unavailable",
                                  "application/json", NULL, "{\"aps\":[]}",
                                  sizeof("{\"aps\":[]}") - 1U);
    }

    int result =
        send_http_response(fd, "200 OK", "application/json", NULL, json, strlen(json));
    cJSON_free(json);
    MYBOT_LOGI(TAG, "Wi-Fi scan complete: aps=%u response=%d",
            (unsigned)result_count, result);
    return result;
}

static int parse_submit_json(const char *body, size_t body_length,
                             char ssid[WIFI_SSID_STR_LEN],
                             char password[WIFI_PASSWORD_LEN]) {
    ssid[0] = '\0';
    password[0] = '\0';
    if (!body || body_length == 0 || memchr(body, '\0', body_length) ||
        contains_json_nul_escape(body, body_length)) {
        return -1;
    }

    const char *parse_end = NULL;
    cJSON *root = cJSON_ParseWithLengthOpts(body, body_length + 1U, &parse_end, true);
    if (!cJSON_IsObject(root) || !parse_end || parse_end != body + body_length) {
        cJSON_Delete(root);
        return -1;
    }

    bool have_ssid = false;
    bool have_password = false;
    int result = -1;
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, root) {
        if (!item->string || !cJSON_IsString(item) || !item->valuestring) {
            goto done;
        }

        char *output = NULL;
        size_t capacity = 0;
        bool *present = NULL;
        if (strcmp(item->string, "ssid") == 0) {
            output = ssid;
            capacity = WIFI_SSID_STR_LEN;
            present = &have_ssid;
        } else if (strcmp(item->string, "password") == 0) {
            output = password;
            capacity = WIFI_PASSWORD_LEN;
            present = &have_password;
        } else {
            goto done;
        }
        if (*present) {
            goto done;
        }

        size_t length = strlen(item->valuestring);
        if (length >= capacity) {
            goto done;
        }
        memcpy(output, item->valuestring, length + 1U);
        *present = true;
    }

    if (have_ssid && have_password && ssid[0] != '\0') {
        result = 0;
    }

done:
    cJSON_ArrayForEach(item, root) {
        if (item->string && strcmp(item->string, "password") == 0 &&
            cJSON_IsString(item) && item->valuestring) {
            secure_zero(item->valuestring, strlen(item->valuestring));
        }
    }
    cJSON_Delete(root);
    if (result < 0) {
        secure_zero(password, WIFI_PASSWORD_LEN);
        ssid[0] = '\0';
    }
    return result;
}

static int send_json_literal(int fd, const char *status, const char *json) {
    return send_http_response(fd, status, "application/json", NULL, json, strlen(json));
}

/* The probe URLs the phone operating systems fetch right after joining a
 * network to decide whether it is a captive portal. With the provisioning
 * SoftAP's DNS hijack every name resolves here, so answering these with a
 * redirect is what makes the browser open the configuration page on its own. */
static bool target_is_captive_probe(const char *target) {
    static const char *const probes[] = {
        "/hotspot-detect.html",      "/generate_204", "/mobile/status.php",
        "/check_network_status.txt", "/ncsi.txt",     "/fwlink/",
        "/connectivity-check.html",  "/success.txt",  "/portal.html",
        "/library/test/success.html",
    };
    for (size_t i = 0; i < sizeof(probes) / sizeof(probes[0]); ++i) {
        if (strncmp(target, probes[i], strlen(probes[i])) == 0) {
            return true;
        }
    }
    return false;
}

/* Returns one only after verified credentials are saved. */
static int handle_submit(int fd, const portal_http_request_t *request) {
    char ssid[WIFI_SSID_STR_LEN] = {0};
    char password[WIFI_PASSWORD_LEN] = {0};
    int result = 0;

    if (!request->has_content_length || !request->content_type_json ||
        parse_submit_json(request->body, request->body_length, ssid, password) < 0) {
        MYBOT_LOGW(TAG, "Wi-Fi submit rejected: invalid request");
        result = send_json_literal(fd, "400 Bad Request",
                                   "{\"success\":false,\"error\":\"Invalid request\"}");
        goto done;
    }

