junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi_portal.c
    MYBOT_LOGI(TAG, "testing submitted Wi-Fi network");
    if (bk7259_wifi_manager_connect_candidate(ssid, password,
                                               PORTAL_CONNECT_TIMEOUT_MS) < 0) {
        MYBOT_LOGW(TAG, "Wi-Fi submit rejected: connection failed");
        result = send_json_literal(
            fd, "409 Conflict",
            "{\"success\":false,\"error\":\"Unable to connect\"}");
        goto done;
    }
    if (bk7259_wifi_manager_save_credentials(ssid, password) < 0) {
        (void)bk7259_wifi_manager_disconnect();
        MYBOT_LOGE(TAG, "Wi-Fi submit failed: credential save failed");
        result = send_json_literal(
            fd, "500 Internal Server Error",
            "{\"success\":false,\"error\":\"Unable to save credentials\"}");
        goto done;
    }

    /* The APSTA channel may change as the STA joins the selected AP, so the
     * phone can leave our SoftAP before it receives this best-effort reply. */
    (void)send_json_literal(fd, "200 OK", "{\"success\":true}");
    result = 1;
    MYBOT_LOGI(TAG, "Wi-Fi submit accepted");

done:
    secure_zero(password, sizeof(password));
    return result;
}

static int handle_http_client(int fd) {
    portal_http_request_t request = {0};
    int result = 0;
    if (receive_http_request(fd, &request) < 0) {
        (void)send_http_response(fd, "400 Bad Request", "text/plain", NULL,
                                 "Bad Request", sizeof("Bad Request") - 1U);
        goto done;
    }

    if (strcmp(request.method, "GET") == 0 && strcmp(request.target, "/") == 0 &&
        request.body_length == 0) {
        result = send_http_response(fd, "200 OK", "text/html; charset=utf-8", NULL,
                                    s_portal_html, sizeof(s_portal_html) - 1U);
    } else if (strcmp(request.method, "GET") == 0 && strcmp(request.target, "/scan") == 0 &&
               request.body_length == 0) {
        result = handle_scan(fd);
    } else if (strcmp(request.method, "POST") == 0 &&
               strcmp(request.target, "/submit") == 0) {
        result = handle_submit(fd, &request);
    } else if (strcmp(request.method, "GET") == 0 && target_is_captive_probe(request.target)) {
        result = send_http_response(fd, "302 Found", "text/html",
                                    "Location: http://192.168.4.1/\r\n", NULL, 0);
    } else {
        result = send_http_response(fd, "404 Not Found", "text/plain", NULL,
                                    "Not Found", sizeof("Not Found") - 1U);
    }

done:
    secure_zero(request.body, sizeof(request.body));
    return result;
}

static int create_http_server(void) {
    int fd = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (fd < 0) {
        return -1;
    }

    int reuse_address = 1;
    struct sockaddr_in address = {
        .sin_family = AF_INET,
        .sin_port = htons(PORTAL_HTTP_PORT),
        .sin_addr.s_addr = inet_addr("192.168.4.1"),
    };
    if (setsockopt(fd, SOL_SOCKET, SO_REUSEADDR, &reuse_address,
                   sizeof(reuse_address)) < 0 ||
        bind(fd, (struct sockaddr *)&address, sizeof(address)) < 0 ||
        listen(fd, 2) < 0) {
        close(fd);
        return -1;
    }
    return fd;
}

static int configure_client_socket(int fd) {
    struct timeval timeout = {
        .tv_sec = (long)(PORTAL_HTTP_IO_TIMEOUT_MS / 1000U),
        .tv_usec = (long)((PORTAL_HTTP_IO_TIMEOUT_MS % 1000U) * 1000U),
    };
    return setsockopt(fd, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout)) == 0 &&
                   setsockopt(fd, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout)) == 0
               ? 0
               : -1;
}

int bk7259_wifi_portal_run(const char *device_id) {
    if (!device_id || device_id[0] == '\0') {
        MYBOT_LOGE(TAG, "portal start rejected: missing device id");
        return -1;
    }

    portal_context_t ctx = {0};
    build_ap_ssid(ctx.ap_ssid, device_id);
    if (start_softap(&ctx) < 0) {
        return -1;
    }

    int result = -1;
    int listen_fd = create_http_server();
    if (listen_fd < 0) {
        MYBOT_LOGE(TAG, "failed to start HTTP server, errno=%d", errno);
        goto done;
    }
    MYBOT_LOGI(TAG, "APSTA portal ready: ssid=%s url=http://192.168.4.1",
            ctx.ap_ssid);

    for (;;) {
        int ready = wait_socket(listen_fd, false, PORTAL_HTTP_POLL_MS);
        if (ready < 0) {
            if (errno == EINTR) {
                continue;
            }
            MYBOT_LOGE(TAG, "HTTP server select failed, errno=%d", errno);
            break;
        }
        if (ready == 0) {
            continue;
        }

        struct sockaddr_in client_address = {0};
        socklen_t client_length = sizeof(client_address);
        int client_fd = accept(listen_fd, (struct sockaddr *)&client_address,
                               &client_length);
        if (client_fd < 0) {
            if (errno == EINTR || errno == EAGAIN || errno == EWOULDBLOCK ||
                errno == ECONNABORTED) {
                continue;
            }
            MYBOT_LOGE(TAG, "HTTP server accept failed, errno=%d", errno);
            break;
        }

        int request_result = -1;
        if (configure_client_socket(client_fd) == 0) {
            request_result = handle_http_client(client_fd);
        }
        (void)shutdown(client_fd, SHUT_RDWR);
        close(client_fd);
        if (request_result == 1) {
            (void)rtos_delay_milliseconds(PORTAL_EXIT_DELAY_MS);
            result = 0;
            break;
        }
    }

    close(listen_fd);

done:
    if (stop_softap(&ctx) < 0) {
        result = -1;
    }
    MYBOT_LOGI(TAG, "APSTA portal stopped: result=%d", result);
    return result;
}
